9. supersonic flow over a backward step/KNP/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.1016 0 -0.5e-4)
    (0.4064 0 -0.5e-4)
    (0 0.01125 -0.5e-4)
    (0.1016 0.01125 -0.5e-4)
    (0.4064 0.01125 -0.5e-4)
    (0 0.15875 -0.5e-4)
    (0.1016 0.15875 -0.5e-4)
    (0.4064 0.15875 -0.5e-4)
    (0.1016 0 0.5e-4)
    (0.4064 0 0.5e-4)
    (0 0.01125 0.5e-4)
    (0.1016 0.01125 0.5e-4)
    (0.4064 0.01125 0.5e-4)
    (0 0.15875 0.5e-4)
    (0.1016 0.15875 0.5e-4)
    (0.4064 0.15875 0.5e-4)


);

blocks
(
    hex (0 1 4 3 8 9 12 11) (240 40 1) simpleGrading (5.7 1 1)
    hex (2 3 6 5 10 11 14 13) (104 112 1) simpleGrading (0.5 6 1)
    hex (3 4 7 6 11 12 15 14) (240 112 1) simpleGrading (5.7 6 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (2 5 13 10)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 4 12 9)
            (4 7 15 12)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (2 3 11 10)
            (0 3 11 8)
            (0 1 9 8)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (2 3 6 5)
            (3 4 7 6)
            (0 1 4 3)
            (10 11 14 13)
            (11 12 15 14)
            (8 9 12 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
